URLShortener/app/models/shortened_url.rb

    def self.random_code
        code = nil
        while true
            code = SecureRandom.urlsafe_base64(6)
            next if ShortenedUrl.exists?(short_url: code)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "nFrO-g8B"], ["LIMIT", 1]]

    def self.create_url(user, long_url)
        ShortenedUrl.create!(short_url: ShortenedUrl.random_code, long_url: long_url, submitter_id: user.id)
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "submitter_id") VALUES ($1, $2, $3) RETURNING "id"  [["short_url", "nFrO-g8B"], ["long_url", "https://stackoverflow.com/questions/11191167/rails-returns-a-nil-when-searching-with-find-by"], ["submitter_id", 1]]